<a href="https://colab.research.google.com/github/Grottersha123/data_sience_stepik/blob/master/1_Intro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from google.colab import drive
drive.mount('/content/drive/')

Drive already mounted at /content/drive/; to attempt to forcibly remount, call drive.mount("/content/drive/", force_remount=True).

In [0]:
cd /content/drive/My Drive/data_sience_stepik

/content/drive/My Drive/data_sience_stepik

In [0]:
import pandas as pd

In [0]:
url_titan = "https://stepik.org/media/attachments/course/4852/titanic.csv"
url_student = "https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv"
url_dota = "https://stepik.org/media/attachments/course/4852/dota_hero_stats.csv"

In [0]:
data = pd.read_csv(url_titan)
data_student = pd.read_csv(url_student)
data_dota = pd.read_csv(url_dota)

In [0]:
data.head(10)
data.info()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [0]:
data_student.head(4)

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44

[4 rows x 8 columns]

In [0]:
count_student = data_student[data_student["lunch"] == "free/reduced"]['lunch'].count() / data_student.shape[0]
count_student

0.355

In [0]:
data_student[data_student["lunch"] == "free/reduced"].describe()

       math score  reading score  writing score
count  355.000000     355.000000     355.000000
mean    58.921127      64.653521      63.022535
std     15.159956      14.895339      15.433823
min      0.000000      17.000000      10.000000
25%     49.000000      56.000000      53.000000
50%     60.000000      65.000000      64.000000
75%     69.000000      75.000000      74.000000
max    100.000000     100.000000     100.000000

In [0]:
data_student[data_student["lunch"] != "free/reduced"].describe()

       math score  reading score  writing score
count  645.000000     645.000000     645.000000
mean    70.034109      71.654264      70.823256
std     13.653501      13.830602      14.339487
min     19.000000      26.000000      22.000000
25%     61.000000      63.000000      62.000000
50%     69.000000      72.000000      72.000000
75%     80.000000      82.000000      81.000000
max    100.000000     100.000000     100.000000

In [0]:
data_dota.groupby("legs")['']